import time

import requests
import json


class Crawl:
    def __init__(self):
        self.api = 'http://m.api.dianping.com/searchshop.json?&regionid=0&categoryid=0&sortid=0&cityid={}&start=0&limit=1'
        self.headers = {
            'User-Agent':'Mozilla/5.0 (Linux; Android 5.0; SM-G900P Build/LRX21T) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.75 Mobile Safari/537.36'
        }
        self.save_path = '/home/dragon/Documents/mycodes/spider-code/test/dianping/region/'
    def request_api(self):
        ids = [[325, '乌鲁木齐'], [326, '克拉玛依'], [327, '吐鲁番市'], [329, '昌吉州'], [330, '博尔塔拉'], [331, '巴音郭楞'], [332, '阿克苏地区'], [333, '克孜勒苏'], [334, '喀什地区'], [335, '和田地区'], [336, '伊犁'], [337, '塔城地区'], [338, '阿勒泰地区'], [339, '石河子'], [340, '台湾'], [341, '香港'], [342, '澳门'], [346, '北屯'], [354, '奎屯市'], [355, '库尔勒市'], [389, '阿拉尔'], [405, '图木舒克'], [409, '五家渠'], [411, '海南州'], [412, '增城市'], [488, '曹妃甸'], [752, '江源县'], [830, '铜山县'], [1039, '新建县'], [1165, '即墨市'], [1167, '胶南市'], [1378, '望城县'], [1468, '清新县'], [1494, '揭东县'], [1536, '临桂县'], [1660, '南溪县'], [1674, '达县'], [1687, '名山县'], [2160, '乐都县'], [2200, '乌鲁木齐县'], [2201, '喀什市'], [2202, '疏附县'], [2203, '疏勒县'], [2204, '英吉沙县'], [2205, '泽普县'], [2206, '莎车县'], [2207, '叶城县'], [2208, '麦盖提县'], [2209, '岳普湖县'], [2210, '伽师县'], [2211, '巴楚县'], [2212, '塔什库尔干塔吉克自治县'], [2213, '阿克苏市'], [2214, '温宿县'], [2215, '库车县'], [2216, '沙雅县'], [2217, '新和县'], [2218, '拜城县'], [2219, '乌什县'], [2220, '阿瓦提县'], [2221, '柯坪县'], [2222, '和田市'], [2223, '和田县'], [2224, '墨玉县'], [2225, '皮山县'], [2226, '洛浦县'], [2227, '策勒县'], [2228, '于田县'], [2229, '民丰县'], [2230, '高昌区'], [2231, '鄯善县'], [2232, '托克逊县'], [2233, '哈密市'], [2234, '伊吾县'], [2235, '巴里坤哈萨克自治县'], [2236, '阿图什市'], [2237, '阿克陶县'], [2238, '阿合奇县'], [2239, '乌恰县'], [2240, '博乐市'], [2241, '精河县'], [2242, '温泉县'], [2243, '昌吉市'], [2244, '阜康市'], [2245, '米泉市'], [2246, '呼图壁县'], [2247, '玛纳斯县'], [2248, '奇台县'], [2249, '吉木萨尔县'], [2250, '木垒哈萨克自治县'], [2251, '轮台县'], [2252, '尉犁县'], [2253, '若羌县'], [2254, '且末县'], [2255, '和静县'], [2256, '和硕县'], [2257, '博湖县'], [2258, '焉耆回族自治县'], [2259, '伊宁市'], [2260, '伊宁县'], [2261, '霍城县'], [2262, '巩留县'], [2263, '新源县'], [2264, '昭苏县'], [2265, '特克斯县'], [2266, '尼勒克县'], [2267, '察布查尔锡伯自治县'], [2268, '塔城市'], [2269, '乌苏市'], [2270, '额敏县'], [2271, '沙湾县'], [2272, '托里县'], [2273, '裕民县'], [2274, '和布克赛尔蒙古自治县'], [2275, '阿勒泰市'], [2276, '布尔津县'], [2277, '富蕴县'], [2278, '福海县'], [2279, '哈巴河县'], [2280, '青河县'], [2281, '吉木乃县'], [2320, '萧山'], [2321, '番禺'], [2323, '黄岛'], [2335, '台北'], [2336, '花莲'], [2337, '高雄'], [2338, '台南'], [2339, '桃园'], [2340, '新北'], [2341, '台中'], [2406, '垦丁'], [2504, '南投'], [2506, '塘沽'], [3170, '基隆'], [3171, '台东'], [3172, '嘉义'], [3173, '宜兰'], [3174, '新竹'], [3175, '彰化'], [3177, '苗栗'], [3594, '阿拉山口市'], [4432, '点评实验室'], [4472, '铁门关市'], [4473, '霍尔果斯市'], [15242, '澎湖'], [15243, '恒春']]
        for id in ids:
            id = id[0]
            url = self.api.format(id)
            data = requests.get(url,headers=self.headers).json()
            time.sleep(6)
            self.save(id,data)


    def save(self,id,data):
        newdata = {}
        newdata['region'] = data['regionNavs']
        newdata['metro'] = data['metroNavs']
        with open(self.save_path + f'{id}.json','w')as f:
            f.write(json.dumps(newdata))
        print(f'save ok {id}')


if __name__ == '__main__':
    crawl = Crawl()
    crawl.request_api()


